server/__tests__/artillery_load_test.yaml
config:
  target: "http://localhost:9003"
  # http:
  #   pool: 5000
  phases:
    - duration: 5
      arrivalRate: 5
      name: Warm up
    - duration: 30
      arrivalRate: 5
      rampTo: 200
      name: Ramp up load
    - duration: 300
      arrivalRate: 200
      name: Sustained load
  processor: './artillery_review.js'

scenarios:
  - name: 'Navigate to two products'
    flow:
      - get:
          url: '/'
      - loop:
        - get:
            url: '/reviews/{{$randomNumber(1,180000)}}/list'
        - get:
            url: '/reviews/{{$randomNumber(1,180000)}}/meta'
        - get:
            url: '/reviews/{{$randomNumber(1,180000)}}/list?sort=helpful'
        count: 50

  - name: 'mark helpful and report reviews'
    flow:
      - get:
          url: '/'
      - loop:
        - get:
            url: '/reviews/{{$randomNumber(1,180000)}}/list'
            capture:
              json: "$.results[0]._id"
              as: "review_id"
        - get:
            url: '/reviews/{{$randomNumber(1,180000)}}/meta'
        - put:
            url: '/reviews/helpful/{{review_id}}'
        - put:
            url: '/reviews/report/{{review_id}}'
        count: 50

  - name: 'Get product and write review'
    flow:
      - function: 'createReview'
      - get:
          url: '/'
      - loop:
        - get:
            url: '/reviews/{{$randomNumber(1,180000)}}/list'
        - get:
            url: '/reviews/{{$randomNumber(1,180000)}}/meta'
        - post:
            url: '/reviews/{{$randomNumber(1,180000)}}'
            json:
              rating: '{{ rating }}'
              summary: '{{ summary }}'
              body: '{{ body }}'
              recommend: '{{ recommend }}'
              name: '{{ name }}'
              email: '{{ email }}'
              photos: '{{ photos }}'
              characteristics: '{{ characteristics }}'
        count: 20